<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Default Filesystem Disk
    |--------------------------------------------------------------------------
    |
    | Здесь вы можете указать файловую систему по умолчанию, которая будет
    | использоваться фреймворком. "local" диск и различные облачные диски
    | доступны для хранения файлов вашего приложения.
    |
    */

    'default' => env('FILESYSTEM_DISK', 'public'),  // Изменил на 'public' для публичных файлов

    /*
    |--------------------------------------------------------------------------
    | Filesystem Disks
    |--------------------------------------------------------------------------
    |
    | Ниже вы можете настроить столько файловых систем, сколько потребуется.
    | Вы можете даже настроить несколько дисков для одного драйвера.
    | Примеры для большинства поддерживаемых драйверов указаны ниже.
    |
    | Поддерживаемые драйверы: "local", "ftp", "sftp", "s3"
    |
    */

    'disks' => [

        'local' => [
            'driver' => 'local',
            'root' => storage_path('app'),
            'throw' => false,
        ],

        'public' => [
            'driver' => 'local',
            'root' => storage_path('app/public'),
            'url' => env('APP_URL') . '/storage',
            'visibility' => 'public',
            'throw' => false,
        ],

        's3' => [
            'driver' => 's3',
            'key' => env('AWS_ACCESS_KEY_ID'),
            'secret' => env('AWS_SECRET_ACCESS_KEY'),
            'region' => env('AWS_DEFAULT_REGION'),
            'bucket' => env('AWS_BUCKET'),
            'url' => env('AWS_URL'),
            'endpoint' => env('AWS_ENDPOINT'),
            'use_path_style_endpoint' => env('AWS_USE_PATH_STYLE_ENDPOINT', false),
            'throw' => false,
        ],

    ],

    /*
    |--------------------------------------------------------------------------
    | Symbolic Links
    |--------------------------------------------------------------------------
    |
    | Здесь вы можете настроить символические ссылки, которые будут созданы
    | при выполнении команды `storage:link` Artisan. Ключи массива — это
    | расположения ссылок, а значения — это их целевые директории.
    |
    */

    'links' => [
        public_path('storage') => storage_path('app/public'),
    ],

];
